/* cocoaControlController */

"applicationShouldTerminate:standardAlert" = "Q can't be closed. There are still guest PCs running.";
"applicationShouldTerminate:informativeText" = "First shutdown the guest PCs then quit Q.";

"toolbar:label:newPC" = "Neuer PC";
"toolbar:paletteLabel:newPC" = "Neuer PC";
"toolbar:toolTip:newPC" = "Neuer PC erstellen";
"toolbar:label:editPC" = "PC bearbeiten";
"toolbar:paletteLabel:editPC" = "PC bearbeiten";
"toolbar:toolTip:editPC" = "PC bearbeiten";
"toolbar:label:removePC" = "PC entfernen";
"toolbar:paletteLabel:removePC" = "PC entfernen";
"toolbar:toolTip:removePC" = "PC entfernen";
"toolbar:label:startPC" = "PC starten";
"toolbar:paletteLabel:startPC" = "PC starten";
"toolbar:toolTip:startPC" = "PC starten";

"editPC:standardAlert" = "Der PC \"%@\" kann nicht bearbeitet werden da er sich im gespeicherten Zustand befindet.";
"editPC:informativeText" = "Bitte fahren Sie den PC \"%@\" zuerst herunter.";

"deletePC:standardAlert" = "Der PC \"%@\" kann nicht beendet werden, da er zur Zeit in Betrieb ist.";
"deletePC:informativeText" = "Bitte fahren Sie zuerst den PC \"%@\" herunter, dann löschen Sie ihn.";
"deletePC:alertWithMessageText" = "Lösche PC";
"deletePC:defaultButton" = "OK";
"deletePC:alternateButton" = "Abbrechen";
"deletePC:informativeTextWithFormat" = "Sind Sie sicher das sie den PC \"%@\" löschen wollen? Der PC wird dauerhaft von ihrer Festplatte entfernt.";

"importVPC7PC:progress:title" = "VPC7 Import";
"importVPC7PC:progress:config" = "VPC7 Konfiguration verarbeiten";
"importVPC7PC:progress:hdx" = "Harddisk_%D.vhd konvertieren";
"importVPC7PC:standardAlert:imageConvert" = "Konvertieren des VPC7 Festplatten-Image fehlgeschlagen";
"importVPC7PC:informativeText:imageConvert" = "Dieser Typ eines VPC Festplatten-Image wird von Q nicht unterstützt.";
"importVPC7PC:standardAlert:plist" = "Importieren des VPC7 PC fehlgeschlagen";
"importVPC7PC:informativeText:plist" = "Kann Configuration.plist nicht lesen!\n";
"importVPC7PC:standardAlert:running" = "Importieren des VPC7 PC fehlgeschlagen";
"importVPC7PC:informativeText:running" = "Der PC ist zur Zeit in Betrieb! Er muss heruntergefahren werden um ihn importieren zu können.";
"importVPC7PC:standardAlert:finish" = "Importieren des VPC PC erfolgreich";
"importVPC7PC:informativeText:finish" = "Bitte überprüfen sie den PC vor dem Start (auf fehlende CD-Roms etc).";

"importQemuXPCs:progress:title" = "QemuX Import";
"importQemuXPCs:progress:config" = "QemuX Konfiguration verarbeiten";
"importQemuXPCs:progress:pc" = "Importiere PC \"%@\"...";
"importQemuXPCs:progress:hdx" = "Kopiere Festplatte %@";
"importQemuXPCs:standardAlert:plist" = "Importieren der QemuX PCs fehlgeschlagen";
"importQemuXPCs:informativeText:plist" = "Kann Liste der QemuX PCs nicht lesen!";
"importQemuXPCs:standardAlert:finish" = "Importieren der QemuX PCs erfolgreich";
"importQemuXPCs:informativeText:finish" = "Bitte überprüfen sie die PCs vor dem Start (auf fehlende CD-Roms etc).";

"exportPCToFlashDrive:savePanel:title" = "Exportieren";
"exportPCToFlashDrive:savePanel:prompt" = "Exportieren";
"exportPCToFlashDrive:progressPanel:title" = "Status";
"exportPCToFlashDrive:progressPanel:text" = "Exportieren";
"exportPCToFlashDrive:progressPanel:statusText1" = "Exportieren..";
"exportPCToFlashDrive:progressPanel:statusText2" = "Programm kopieren..";
"exportPCToFlashDrive:progressPanel:statusText3" = "Gast PC kopieren..";
"exportPCToFlashDrive:progressPanel:statusText4" = "Gast PC Einstellungen schreiben..";
"exportPCToFlashDrive:progressPanel:statusText5" = "Weitere Gast PC Dateien kopieren..";
"exportPCToFlashDrive:progressPanel:statusText6" = "Gast PC Einstellungen schreiben beenden..";
"exportPCToFlashDrive:alert:writeToFile:messageText" = "Fehler beim Schreiben der Einstellungen";
"exportPCToFlashDrive:alert:writeToFile:informativeText" = "Die Konfigurationsdatei konnte nicht geschrieben werden.";
"exportPCToFlashDrive:alert:exportFinished:messageText" = "Exportieren beendet";
"exportPCToFlashDrive:alert:exportFinished:informativeText" = "Das Exportieren des Gast PC %@ ist beendet. Sie können ihn nun als eigenständiges Programm auf jedem Power PC oder Intel Mac ausführen.";

"exportThisPCToFlashDrive:standardAlert" = "Der Gast PC \"%@\" kann nicht auf einen USB Stick exportiert werden, da er noch in Betrieb oder gespeichert ist.";
"exportThisPCToFlashDrive:informativeText" = "Bitte beenden sie zuerst den Gast PC \"%@\" und exportieren sie ihn dann.";

"exportThisPCToFlashDrive:alertWithMessageText" = "Gast PC \"%@\" exportieren";
"exportThisPCToFlashDrive:defaultButton" = "OK";
"exportThisPCToFlashDrive:alternateButton" = "Abbrechen";
"exportThisPCToFlashDrive:informativeTextWithFormat" = "Der Gast PC wird nun als ausführbares Programm exportiert. Das heisst sie können ihn z.B. auf einem USB Stick speichern und ihn dann an jedem Mac ohne weiteres starten.\n\nBitte beachten sie das das Speichern/Laden des Gast PC in diesem Modus nicht zur Verfügung steht. Dies betrifft jedoch nicht ihre Gast PC Konfiguration in Q.";

"importPCFromFlashDrive:alert:notFound:messageText" = "Kann den Gast PC nicht finden";
"importPCFromFlashDrive:alert:notFound:informativeText" = "Die Datei scheint ein gewöhnliches Programm zu sein";
"importPCFromFlashDrive:progressPanel:title" = "Status";
"importPCFromFlashDrive:progressPanel:text" = "Importieren";
"importPCFromFlashDrive:progressPanel:statusText1" = "Gast PC kopieren..";
"importPCFromFlashDrive:alert:importFinished:messageText" = "Importieren beendet";
"importPCFromFlashDrive:alert:importFinished:informativeText" = "Der Import des Gast PC %@ is beendet. Sie können ihn nun in Q starten.";

"addArgumentTo:standardAlert" = "Kann den PC nicht starten";
"addArgumentTo:informativeText" = "Diese Konfiguration nutzt vor-0.8.0 Syntax (%@). Bitte entfernen Sie diesen aus dem Erweitert Tab.";

"URLResourceDidFinishLoading:alertWithMessageText" = "Eine neue Version von Q ist verfügbar. Wollen Sie sie jetzt herunterladen?";
"URLResourceDidFinishLoading:defaultButton" = "OK";
"URLResourceDidFinishLoading:alternateButton" = "Abbrechen";

"tableView:audio" = "Audio: %@\n";
"tableView:mb" = "%@, %@MB\n";

"updateThisPC:standardAlert" ="Der Gast \"%@\" kann nicht aktualisiert und komprimiert werden, da er noch in Betrieb oder gespeichert ist.";
"updateThisPC:informativeText" = "Bitte beenden sie zuerst den Gast PC \"%@\" und aktualisieren sie ihn dann.";
"updateThisPC:alertWithMessageText" = "Gast PC aktualisieren und komprimieren";
"updateThisPC:informativeTextWithFormat" = "Alle Festplatten dieses Gastes werden in qcow2 Format überführt und komprimiert. Diese Festplatten können auf OS X nicht mehr gemounted werden. Das qcow2 Format ist das einzige Format, das das Sichern eines laufenden Gastes erlaubt.";
"updateThisPC:defaultButton" = "Weiterfahren";
"updateThisPC:alternateButton" = "Abbrechen";
"updatePC:progress:title" = "Status";
"updatePC:progress:text" = "Konvertiere und komprimiere...";
"updatePC:progress:config" = "Dieser Prozess wird einige Minuten in Anspruch nehmen.";
"updatePC:standardAlert:imageConvert" = "Konversion ist fehlgeschlagen.";
"updatePC:informativeText:imageConvert" = "Bitte prüfen sie die Diskimages.";


/* vmstate */

"running" = "in Betrieb";
"saved" = "gespeichert";
"shutdown" = "heruntergefahren";


/* cocoaControlDiskImage */

"dIWindowCreate:file" = "Mein neues Festplatten-Image.%@";

"savePanelDidEnd:dIName" = "Festplatten-Image: %@";


/* cocoaControlEditPC */

"prepareEditPCPanel:newPC" = "PC erstellen";
"prepareEditPCPanel:updatePC" = "Übernehmen";

"toolbar:label:general" = "Allgemein";
"toolbar:paletteLabel:general" = "Allgemein";
"toolbar:toolTip:general" = "Allgemein";
"toolbar:label:hardware" = "Hardware";
"toolbar:paletteLabel:hardware" = "Hardware";
"toolbar:toolTip:hardware" = "Hardware";
"toolbar:label:advanced" = "Erweitert";
"toolbar:paletteLabel:advanced" = "Erweitert";
"toolbar:toolTip:advanced" = "Erweitert";
"toolbar:label:network" = "Netzwerk";
"toolbar:paletteLabel:network" = "Netzwerk";
"toolbar:toolTip:network" = "Netzwerk";

"viewGeneral:title" = "Q %@ - Allgemein";

"viewHardware:title" = "Q %@ - Hardware";

"viewAdvanced:title" = "Q %@ - Erweitert";

"viewNetwork:title" = "Q %@ - Netzwerk";

"setCustomDIType:title" = "Benutzerdefiniertes Image";

"editPCEditPCPanel:name" = "Bitte Namen eingeben";
"editPCEditPCPanel:charName" = "Name mit unerlaubten Zeichen (:./)";
"editPCEditPCPanel:otherName" = "anderen Namen wählen";

"initFirewallSettings:popUpButtonFirewallAdittionalPortsCustom" = "Benutzerdefiniert..";

"startShowEditPort:restrictedPorts1" = "%@,%@ des Hosts auf Port(s) %@,%@ des Gast PCs weiter (TCP and UDP).";
"startShowEditPort:restrictedPorts2" = "%@ des Hosts auf Port(s) %@ des Gast PCs weiter (TCP).";
"startShowEditPort:restrictedPorts2" = "%@ des Hosts auf Port(s) %@ des Gast PCs (UDP).";
"startShowEditPort:AlertSheet:messageText" = "Dieser Dienst kann nicht bearbeitet werden";
"startShowEditPort:AlertSheet:defaultButton" = "OK";
"startShowEditPort:AlertSheet:informativeText" = "%@ leitet eingehende Verbindungen von Port(s) %@";

"startEditPort:popUpButtonFirewallAdittionalPortsCustom" = "Benutzerdefiniert..";

"deletePort:AlertSheet:messageText" = "Dieser Dienst kann nich gelöscht werden";
"deletePort:AlertSheet:defaultButton" = "OK";
"deletePort:AlertSheet:informativeText" = "Um diesen Dienst zu deaktivieren benutzen Sie bitte dazugehörige Checkbox.";

"checkPort:textFieldFirewallPortError:name" = "Kein leerer Name!";
"checkPort:textFieldFirewallPortError:hostport" = "Kein leerer Host-Port Eintrag!";
"checkPort:textFieldFirewallPortError:guestport" = "Kein leerer Gast-Port Eintrag!";
"checkPort:textFieldFirewallPortError:illegalchars" = "Unerlaubte Zeichen in den Portangaben!";
"checkPort:textFieldFirewallPortError:combination" = "Kombination von , und - nicht erlaubt";


/* cocoaControlPreferences */

"toolbar:label:general" = "Allgemein";
"toolbar:paletteLabel:general" = "Allgemein";
"toolbar:toolTip:general" = "Allgemein";

"viewGeneral:title" = "Allgemein";

/* cocoaDownload */

"startBTDownload:torrentFile:length" = "Bittorrent Meta-Datei konnte nicht geladen werden. Die Datei existiert nicht mehr oder der Server ist nicht erreichbar.";
"startBTDownload:torrentFile:tError:invalid" = "Bittorrent: Ungültiger Torrent / beschädigte Torrent Datei.";
"startBTDownload:torrentFile:tError:unsupported" = "Bittorrent: Nicht unterstütztes Dateiformat.";
"startBTDownload:torrentFile:tError:exists" = "Bittorrent: Torrent existiert bereits.";
"startBTDownload:torrentFile:tError:miscellanious" = "Bittorrent: Unbekannter Fehler.";

"checkDownloadStarted:errorDescription" = "Verbindung mit Server konnte nach 60 Sekunden nicht hergestellt werden.";

/* cocoaDownloadController */

"showAllDownloads:AlertSheet:standardAlert" = "Kann PCs von free.oszoo.org nicht anzeigen.";
"showAllDownloads:AlertSheet:defaultButton" = "OK";
"showAllDownloads:AlertSheet:informativeText" = "Konnte die Liste der downloadbaren PCs nicht von kju-app.org laden.";

"tableView:objectValueForTableColumn:Size" = "Dateigröße";
"tableView:objectValueForTableColumn:Author" = "erstellt von";

"showDetails:MoreInfo" = "Mehr Informationen";
"startDownload:downloadButton:Title" = "Stopp";
"startDownload:statusText:Text" = "Download starten...";

"stopDownload:AlertSheet:standardAlert" = "Es sind Downloads aktiv";
"stopDownload:AlertSheet:defaultButton" = "Stopp";
"stopDownload:AlertSheet:alternativeButton" = "Abbrechen";
"stopDownload:AlertSheet:informativeText" = "Sind Sie sicher, dass Sie den Download abbrechen wollen?";

"downloadDidReceiveData:remainingString1" = "%d Stunden %d Minuten verbleibend";
"downloadDidReceiveData:remainingString2" = "%d Minuten %d Sekunden verbleibend";
"downloadDidReceiveData:remainingString3" = "ungefähr %d Minuten verbleibend";
"downloadDidReceiveData:remainingString4" = "ungefähr %d Sekunden verbleibend";
"downloadDidReceiveData:connecting" = "Verbinden..";
"downloadDidReceiveData:statusText1" = "%.0f %@ of %.1f %@ (%d kB/s), %@";
"downloadDidReceiveData:statusText2" = "%.1f %@ of %.1f %@ (%d kB/s), %@";

"downloadDidFinish:statusText" = "Download beendet.";
"downloadDidFail:statusText" = "Download fehlgeschlagen.";
"downloadDidFail:AlertSheet:standardAlert" = "Download fehlgeschlagen";
"downloadDidFail:AlertSheet:defaultButton" = "OK";

"uncompressPC:statusText" = "Dateien entpacken..";

"finishDownload:statusText1" = "Importiere freies Betriebssystem..";
"finishDownload:message1" = "Sie können jetzt ihr freies Betriebssystem nutzen.";
"finishDownload:message2" = "Die Festplatte konnte nicht gefunden werden. Bitte überprüfen Sie die Einstellungen bevor sie ihr freies Betriebssystem nutzen.";
"finishDownload:message3" = "Die Dateien konnten nicht entpackt werden. Das Archiv scheint beschädigt zu sein. Sie können versuchen Sie manuell zu entpacken oder diesen Fehler an free.oszoo.org melden.\n\nPath: %@";
"finishDownload:message4" = "Die Dateien konnten nicht entpackt werden. Die heruntergeladene Datei scheint kein Archiv zu sein.\n\nPath: %@";
"finishDownload:AlertSheet:messageText" = "Importieren beendet.";
"finishDownload:AlertSheet:defaultButton" = "OK";
"finishDownload:statusText2" = "Beendet.";
